app/controllers/robots_controller.rb

SELECT name,created_time FROM "robots"
---
  def index
    @robots = Robot.select('name,created_at').all

SELECT "robots".* FROM "robots" WHERE "robots"."name" IS NULL LIMIT 1
---
  def show
    @robot = Robot.where(:name => params[:name]).first

SELECT "robots".* FROM "robots" WHERE "robots"."name" = 'x1' LIMIT 1
---
  def edit
    @robot = Robot.where(:name => params[:name]).first

INSERT INTO "robots" ("created_at", "name", "robot_datas", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 23 Dec 2013 14:05:36 UTC +00:00], ["name", "gtrtt"], ["robot_datas", {"color"=>"ggggg", "size"=>"ereeee"}], ["updated_at", Mon, 23 Dec 2013 14:05:36 UTC +00:00]]
INSERT INTO "robothistories" ("created_at", "field", "robot_id", "status", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 12 Dec 2013 19:59:42 UTC +00:00], ["field", "name"], ["robot_id", nil], ["status", "create"], ["updated_at", Thu, 12 Dec 2013 19:59:42 UTC +00:00], ["value", "x1"]]
---
  def create
    @robot = Robot.new(params[:robot])
    if @robot.save
      params[:robot].each do |key, value|
        if value.present?
          @robothistory = Robothistory.new
          @robothistory.status='create'
          @robothistory.robot_id = @robot.id
          @robothistory.field=key
          @robothistory.value=value
          @robothistory.save

SELECT "robots".* FROM "robots" WHERE "robots"."name" IS NULL LIMIT 1
UPDATE "robots" SET "size" = 2, "weight" = 3, "status" = '4', "color" = '5', "age" = 6, "eyes_number" = 7, "antenna_number" = 8, "updated_at" = '2013-12-11 22:29:24.995360' WHERE "robots"."id" = 1
INSERT INTO "robothistories" ("created_at", "field", "robot_id", "status", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 12 Dec 2013 20:39:51 UTC +00:00], ["field", "name"], ["robot_id", nil], ["status", "update"], ["updated_at", Thu, 12 Dec 2013 20:39:51 UTC +00:00], ["value", "x1"]]
---
  def update
    @robot = Robot.where(:name => params[:name]).first
    @org_robot = Robot.where(:name => params[:name]).first

    if @robot.update_attributes(params[:robot])
      if params[:robot].present?
        params[:robot].each do |key, value|
          if value.present?
            if @org_robot["#{key}"] != value
              @robothistory = Robothistory.new
              @robothistory.status='update'
              @robothistory.robot_id = @robot.id
              @robothistory.field=key
              @robothistory.value=value
              @robothistory.save