app/controllers/robots_controller.rb

SELECT "robots".* FROM "robots"
---
  def index
    @robots = Robot.all

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @robot = Robot.find(params[:id])

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", "1"]]
---
  def set_robot
    @robot = Robot.find(params[:id])