app/controllers/robothistories_controller.rb

  def show
    #@robot = Robot.where(:name => params[:name]).includes(:robothistories)
    @robothistories = Robothistory.where(:robots => {:name => params[:name]}).includes(:robot).order(:robothisies => :id)
    objbArray=Hash.new
    @robothistories.each do |history|
---
SELECT "robothistories".* FROM "robothistories" WHERE "robothistories"."robot_id" IN (1)
SELECT "robothistories".* FROM "robothistories" WHERE "robot"."name" = 'x3'
SELECT "robots".* FROM "robots" WHERE "robots"."name" = 'x1'